package com.dmilut.lesson_09.homework;

public class Homework {

    // Easy level
<<<<<<< HEAD

    // Medium level

    // Hard level
=======
    /* TODO: 8/24/20
        1.1. Реализовать абстрактный класс Animal
        1.2. Реализовать абстрактный метод voice */

    /* TODO: 8/24/20
        2.1. Реализовать класс Dog наследованный от Animal
        2.2. Реализовать метод voice */

    /* TODO: 8/24/20
        3.1. Реализовать класс Cat наследованный от Animal
        3.2. Реализовать метод voice */

    /* TODO: 8/24/20
        4.1. Добавить в класс Dog поля name, age, weight, type
        4.2. Реализовать геттеры и сеттеры для этих полей */

    /* TODO: 8/24/20
        5.1. Добавить в класс Cat поля name, age, weight, type
        5.2. Реализовать геттеры и сеттеры для этих полей */

    // Medium level
    /* TODO: 8/24/20
        6.1. Реализовать класс AnimalManager
        6.2. Реализовать методы в котором кошки и собаки будут сортироваться в зависимости от возраста на 2 категории:
         щенки (котята) и взрослые особи
        6.3. Реализовать методы в котором кошки и собаки будут складываться в массивы puppies, kittens, dogs, cats
        в зависимости от результата работы методов из п. 6.3. */

    // Hard level
    /* TODO: 8/24/20
        7.1. Творческое задание. Реализовать метод selectionOfFood в классе AnimalManager в котором животное будет
        проверяться на наличие в массивах puppies, kittens, dogs, cats и в зависимости от того, щенок (котенок) это
        или взрослая особь, будет предлагаться соответствующее питание. */

>>>>>>> 1bc8cc7a826a7ee15a0f9e279be01e698061bfba
}