package com.dmilut.lesson_07.homework.homeworkOlga;

public class HomeworkOlga {

    public static void main(String[] args) {
                    //  Easy level
                    /* TODO: 8/17/20
                    1.1. Реализовать класс Fish
                    1.2. Реализовать поля класса Fish: name, size, color, edible
                    1.3. Реализовать методы класса Fish: swim, eat
                    1.4. Создать пустой конструктор класса Fish
                    1.5. Создать конструктор класса Fish с аргументами в виде полей класса */

        System.out.println('\n' + "Задача 1.1.-1.5.");


                /* TODO: 8/17/20
                    2.1. Создать экземпляр класса Fish используя пустой конструктор
                    2.2. Создать экземпляр класса Fish используя конструктор для инициализации полей */

        System.out.println('\n' + "Задача 2.1.-2.2.");

                /* TODO: 8/17/20
                    3.1. Создать static метод, который будет сравнивать размер двух рыб и выводить в консоль название
                    большей рыбы */

        System.out.println('\n' + "Задача 3.1.");

                //  Hard level
                /* TODO: 8/17/20
                    4.1. Создать массив Fish
                    4.2. Заполнить массив 5 произвольными объектами Fish с инициализированными полями
                    4.3. Создать static метод, который будет искать самую большую рыбу и выводить в консоль текст вида "Эта рыба
                     вот такого размера ..."
                    4.4. Создать static метод, который будет проверять съедобна эта рыба или нет и выводить в консоль "И ее
                     можно съесть!" или "Но ее нельзя съесть!" */

        System.out.println('\n' + "Задача 4.1.-4.4.");


    }
}









