package com.dmilut.lesson_08.homework;

public class Homework {

    // Easy level
    /* TODO: 8/20/20
        1.1. Реализовать класс Animal
        1.2. Реализовать поля name, age, type, color
        1.3. Реализовать метод move, так, чтобы он выводил в консоль "Какое-то движение"
        1.4. Реализовать методы eat, sleep */

    /* TODO: 8/20/20
        2.1. Реализовать класс Monkey наследованный от Animal
        2.2. Переопределить метод move, так, чтобы он выводил в консоль "Лазанье по деревьям" */

    /* TODO: 8/20/20
        3.1. Реализовать класс Dog наследованный от Animal
        3.2. Переопределить метод move, так, чтобы он выводил в консоль "Бег"
        3.3. Реализовать метод bark */

    /* TODO: 8/20/20
        4.1. Создать объект класса Animal, инициализировать его поля и вывести их значения в консоль
        4.2. У созданного объекта класса Animal вызвать методы eat, sleep и move */

    /* TODO: 8/20/20
        5.1. Создать объект класса Monkey, инициализировать унаследованные поля и вывести их значения в консоль
        5.2. У созданного объекта класса Monkey вызвать методы eat, sleep и move */

    /* TODO: 8/20/20
        6.1. Создать объект класса Dog, инициализировать унаследованные поля и вывести их значения в консоль
        6.2. У созданного объекта класса Dog вызвать методы eat, sleep, move, bark
        6.3. У созданного объекта класса Dog вызвать унаследованный метод move */
}
