package com.dmilut.lesson_06.homework;

public class Homework {
    public static void main(String[] args) {

        // Easy level
        /* TODO: 8/12/20
            1.1. Объявить массив int
            1.2. Создать массив из п.1.1. с размером 10
            1.3. Инициализировать массив из п.1.1. с набором данных: 0,1,2,3,4,5,6,7,8,9 двумя различными путями
         */

        /* TODO: 8/12/20
            2.1. Строку "Я люблю массивы очень сильно!" сохранить в массиве разбив по словам и символам
            2.2. Вывести в консоль все элменты массива из п.2.1. так, чтобы получилась первоначальная строка
         */

        /* TODO: 8/12/20
            3.1. Используя цикл for вывести все элементы массива [9, 8, 7, 6, 5, 4, 3, 2, 1, 0] в консоль
            3.2. Сделать п.3.1. с циклом foreach
            3.3. Сделать п.3.1. с циклом while
         */

        /* TODO: 8/12/20
            4.1. Используя циклы вывести все элементы массива
            [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
            [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
            в консоль
         */

        // Middle level
        /* TODO: 8/12/20
            5.1. Создать массив с названиями 5 цветов на ваше усмотрение (н.п.: розовый, черный, красный, желтый, белый)
            5.2. Вывести в консоль строчку из песни "Цвет настроения синий!" меняя цвет на цвета из массива.
            Сделать это используя цикл.
         */

        /* TODO: 8/12/20
            6.1. Найти и вывести в консоль наименьшее число из произвольного массива int
         */

        /* TODO: 8/12/20
            7.1. Найти и вывести в консоль наибольшее число из произвольного массива int
         */

        /* TODO: 8/12/20
            8.1. Найти и вывести в консоль только четные числа из произвольного массива int
         */

        /* TODO: 8/12/20
            9.1. Используя цикл for вывести все элементы массива [9, 8, 7, 6, 5, 4, 3, 2, 1, 0] в консоль в порядке
             возрастания
         */

        //Hard level
        /* TODO: 8/12/20
            10.1. Нарисовать в консоли поле для игры в "крестики-нолики" из 9 клеток используя данные из многомерного
             массива
            10.2. Записать в поле произвольно поставленный "крестик"
            10.3. Записать в поле произвольно поставленный "нолик", проверив, что он ставится на свободное место
            10.4. Вывести поле с "крестиками" и "ноликами" в консоль
         */

        /* TODO: 8/12/20
            11.1. Создать многомерный массив, который бы хранил информацию о игровом поле игры "морской бой" с размером
            поля 10x10
            11.2. Заполнить поле кораблями из расчета:
                5 1-клеточных
                4 2-клеточных
                3 3-клеточных
                2 4-клеточных
                1 5-клеточный
            11.3. Вывести поле с кораблями в консоль
         */

    }
}
